app/views/sales/shared/_sale_payments.html.erb

SELECT "payments".* FROM "payments" WHERE "payments"."sale_id" = $1  [["sale_id", 1]]
---
    <tbody>
      <% if @sale.payments.blank? %>

SELECT COUNT(*) FROM "payments" WHERE "payments"."sale_id" = $1  [["sale_id", 1]]
---

<% if @sale.remaining_balance <= 0.00 && @sale.payments.count > 0 %>