app/controllers/configurations_controller.rb

SELECT "store_configurations".* FROM "store_configurations" WHERE "store_configurations"."id" = $1 LIMIT 1  [["id", 1]]
---
	def index
		@configuration = StoreConfiguration.find(1)

SELECT "store_configurations".* FROM "store_configurations" WHERE "store_configurations"."id" = $1 LIMIT 1  [["id", 1]]
---
    def set_configuration
      @configuration = StoreConfiguration.find(1)