app/controllers/customers_controller.rb

  def index
    @customers = Customer.paginate(:page => params[:page], :per_page => 20).where(:published => true)
---
SELECT "customers".* FROM "customers" WHERE "customers"."published" = 't' LIMIT 20 OFFSET 0