app/controllers/items_controller.rb

SELECT "items".* FROM "items" WHERE "items"."published" = 't' ORDER BY sku ASC LIMIT 20 OFFSET 0
---
  def index
    @items = Item.paginate(:page => params[:page], :per_page => 20).where(:published => true, :user_id => current_user.user_id)