app/controllers/sales_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = 1 ORDER BY "users"."id" ASC LIMIT 1
---
  def new
    @sale_by_vet = Sale.where(:user_id=>current_user.user_id).last