app/controllers/sales_controller.rb

  def index
    @sales = Sale.paginate(:page => params[:page], :per_page => 20, :order => 'id DESC')
---
SELECT "sales".* FROM "sales" ORDER BY id DESC LIMIT 20 OFFSET 0

  def new
    @sale = Sale.create
---
INSERT INTO "sales" ("created_at", "updated_at") VALUES ($1, $2) RETURNING "id"  [["created_at", Mon, 13 Apr 2015 23:17:54 UTC +00:00], ["updated_at", Mon, 13 Apr 2015 23:17:54 UTC +00:00]]

  def destroy
    set_sale

    if current_user.can_update_items == true
      @sale.destroy
---
DELETE FROM "sales" WHERE "sales"."id" = $1  [["id", 2]]

    def set_sale
      if @sale.blank?
        if params[:sale_id].blank?
          if params[:search].blank?
            @sale = Sale.find(params[:id])
---
SELECT "sales".* FROM "sales" WHERE "sales"."id" = $1 LIMIT 1  [["id", "2"]]