app/controllers/users_controller.rb

  def index
    @users = User.paginate(:page => params[:page], :per_page => 20)
---
SELECT "users".* FROM "users" LIMIT 20 OFFSET 0

  def new_user
    @user = User.new(:email => params[:user][:email], :username => params[:user][:username], :password => params[:user][:password], :password_confirmation => params[:user][:password_confirmation])

    respond_to do |format|
      if @user.save
---
INSERT INTO "users" ("created_at", "email", "encrypted_password", "updated_at", "username") VALUES ($1, $2, $3, $4, $5) RETURNING "id"

  def update

    if user_params[:password].blank?
      user_params.delete("password")
      user_params.delete("password_confirmation")
    end

    respond_to do |format|
      if @user.update(user_params)
---
UPDATE "users" SET "encrypted_password" = $1, "updated_at" = $2 WHERE "users"."id" = 1  [["encrypted_password", "$2a$10$TyCbwhfdYays0v8pca/dYuGazmS.O5N1R5OPPeETpcy0Gq5IX.LH6"], ["updated_at", Tue, 14 Apr 2015 13:28:27 UTC +00:00]]